In [1]:
# 3049
import numpy as np
from datascience import *
Student = Table().with_columns('Roll', make_array(3033,3022,3043),
    'Name',  make_array ('abhi', 'rushi', 'om'),
    'Marks', make_array (30, 34, 32)
)
Student

Roll | Name  | Marks
3033 | abhi  | 30
3022 | rushi | 34
3043 | om    | 32

In [3]:
#3049
Student_selected=Student.take(np.arange(1, 3))
Student_selected

Roll | Name  | Marks
3022 | rushi | 34
3043 | om    | 32

In [4]:
#3039
Student=Student.with_columns('Rank',make_array(1,2,3))
Student

Roll | Name  | Marks | Rank
3033 | abhi  | 30    | 1
3022 | rushi | 34    | 2
3043 | om    | 32    | 3

In [5]:
#3039
Student=Student.sort("Rank")
Student

Roll | Name  | Marks | Rank
3033 | abhi  | 30    | 1
3022 | rushi | 34    | 2
3043 | om    | 32    | 3

In [6]:
#3039
Student=Student.sort("Rank", descending=True)
Student

Roll | Name  | Marks | Rank
3043 | om    | 32    | 3
3022 | rushi | 34    | 2
3033 | abhi  | 30    | 1